-- TRIM(s) — удаляет пробелы в начале и конце строки s

DROP TABLE IF EXISTS `products`;

CREATE TABLE `products` (
    id    INT          NOT NULL AUTO_INCREMENT,
    name  VARCHAR(100) DEFAULT NULL,
    count INT          DEFAULT NULL,
    price INT          DEFAULT NULL,

    PRIMARY KEY (`id`)
);

INSERT INTO `products` (id, name, count, price)
VALUES
    (1, '  Системный блок  ', 28, 48000),
    (2, '  Клавиатура  ', 100, 1200),
    (3, '  Мышь  ', 300, 300),
    (4, '  Монитор  ', 47, 14000),
    (5, '  Принтер  ', 5, 7400),
    (6, '  МФУ  ', 2, 19400),
    (7, '  Стол  ', 12, 3100),
    (8, '  Кресло  ', 24, 5700),
    (9, '  Шредер  ', 3, 11200),
    (10, '  Лампа  ', 70, 400);

UPDATE `products`
SET `name` = TRIM(`name`);

SELECT * FROM `products`;

-- +----+----------------+-------+-------+
-- | id | name           | count | price |
-- +----+----------------+-------+-------+
-- | 1  | Системный блок | 28    | 48000 |
-- | 2  | Клавиатура     | 100   | 1200  |
-- | 3  | Мышь           | 300   | 300   |
-- | 4  | Монитор        | 47    | 14000 |
-- | 5  | Принтер        | 5     | 7400  |
-- | 6  | МФУ            | 2     | 19400 |
-- | 7  | Стол           | 12    | 3100  |
-- | 8  | Кресло         | 24    | 5700  |
-- | 9  | Шредер         | 3     | 11200 |
-- | 10 | Лампа          | 70    | 400   |
-- +----+----------------+-------+-------+
