-- CEIL(x) — округляет x вверх до ближайшего целого

DROP TABLE IF EXISTS `posts`;

CREATE TABLE `posts` (
    id        INT          NOT NULL AUTO_INCREMENT,
    title     VARCHAR(100) DEFAULT NULL,
    author_id INT          DEFAULT NULL,
    comments  INT          DEFAULT NULL,

    PRIMARY KEY (`id`)
);

INSERT INTO `posts` (id, title, author_id, comments)
VALUES
    (1, 'Массовая атака на оборудование Cisco', 43, 10),
    (2, 'Знакомство с новым элементом dialog', 218, 23),
    (3, 'Что такое «Большие данные»', 7361, 37),
    (4, 'Электронные книги и их форматы', 7, 50),
    (5, 'Мангровый лес: крутейший биом планеты', 245, 5),
    (6, 'Электроотвёртка своими руками или наш ответ Xiaomi', 144, 3),
    (7, 'Реверс инжиниринг процессора ARM1', 116, 8),
    (8, 'Программирование современных микроконтроллеров', 565, 113),
    (9, 'Переработка мусора: как уменьшить количество свалок', 4515, 6),
    (10, 'Подключаем счетчик воды к умному дому', 33, 81);

SELECT `id`, `comments`, CEIL(`comments` / 10) AS `pages`
FROM `posts`;

-- +----+----------+-------+
-- | id | comments | pages |
-- +----+----------+-------+
-- | 1  | 10       | 1     |
-- | 2  | 23       | 3     |
-- | 3  | 37       | 4     |
-- | 4  | 50       | 5     |
-- | 5  | 5        | 1     |
-- | 6  | 3        | 1     |
-- | 7  | 8        | 1     |
-- | 8  | 113      | 12    |
-- | 9  | 6        | 1     |
-- | 10 | 81       | 9     |
-- +----+----------+-------+
