-- ROUND(x, d) — округляет x до d знаков после запятой

DROP TABLE IF EXISTS `films`;

CREATE TABLE `films` (
    id     INT         NOT NULL AUTO_INCREMENT,
    name   VARCHAR(50) DEFAULT NULL,
    rating FLOAT       DEFAULT NULL,
    year   INT         DEFAULT NULL,
    votes  INT         DEFAULT NULL,

    PRIMARY KEY (`id`)
);

INSERT INTO `films` (id, name, rating, year, votes)
VALUES
    (1, 'Зеленая миля', 9.135, 1999, 431238),
    (2, 'Бойцовский клуб', 8.715, 1999, 410297),
    (3, 'Форрест Гамп', 9.013, 1994, 421514),
    (4, 'Побег из Шоушенка', 9.191, 1994, 460078),
    (5, 'Список Шиндлера', 8.884, 1993, 233033),
    (6, 'Иван Васильевич меняет профессию', 8.707, 1973, 320339),
    (7, 'Леон', 8.778, 1994, 351308),
    (8, 'Начало', 8.775, 2010, 484028),
    (9, '1+1', 8.838, 2011, 444942),
    (10, 'Король Лев', 8.758, 1994, 300302);

SELECT `name`, ROUND(`rating`, 2) AS `rating`
FROM `films`
ORDER BY `rating` DESC
LIMIT 5;

-- +-------------------+--------+
-- | name              | rating |
-- +-------------------+--------+
-- | Побег из Шоушенка | 9.19   |
-- | Зеленая миля      | 9.14   |
-- | Форрест Гамп      | 9.01   |
-- | Список Шиндлера   | 8.88   |
-- | 1+1               | 8.84   |
-- +-------------------+--------+
