-- CURDATE() — возвращает текущую дату (без времени)

DROP TABLE IF EXISTS `tasks`;

CREATE TABLE `tasks` (
    id           INT          NOT NULL AUTO_INCREMENT,
    name         VARCHAR(100) DEFAULT NULL,
    planned_date DATE         DEFAULT NULL,

    PRIMARY KEY (`id`)
);

INSERT INTO `tasks` (id, name, planned_date)
VALUES
    (1, 'Подключить базу', '2017-04-10'),
    (2, 'Подключить css', '2017-06-14'),
    (3, 'Спроектировать БД', '2028-01-01'),
    (4, 'Почитать про flask', '2017-04-01'),
    (5, 'Выбрать базу данных', '2029-09-01'),
    (6, 'Выбрать фреймворк', '2029-04-01'),
    (7, 'Посмотреть видео про css grid', '2017-06-14'),
    (8, 'Проработать архитектуру', '2029-06-14');

SELECT *
FROM `tasks`
WHERE `planned_date` > CURDATE()
ORDER BY `planned_date`;

-- +----+-------------------------+--------------+
-- | id | name                    | planned_date |
-- +----+-------------------------+--------------+
-- | 3  | Спроектировать БД       | 2028-01-01   |
-- | 6  | Выбрать фреймворк       | 2029-04-01   |
-- | 8  | Проработать архитектуру  | 2029-06-14   |
-- | 5  | Выбрать базу данных     | 2029-09-01   |
-- +----+-------------------------+--------------+
