-- DATE_ADD(dt, INTERVAL n unit) — прибавляет к дате dt интервал n единиц unit
-- DATE(dt)                      — извлекает дату из datetime dt (без времени)
-- HOUR(dt)                      — извлекает час из datetime dt

DROP TABLE IF EXISTS `calendar`;

CREATE TABLE `calendar` (
    id         INT          NOT NULL AUTO_INCREMENT,
    name       VARCHAR(100) DEFAULT NULL,
    visit_date DATETIME     DEFAULT NULL,

    PRIMARY KEY (`id`)
);

INSERT INTO `calendar` (id, name, visit_date)
VALUES
    (1, 'Иванов Иван Иванович', '2017-05-14 08:00:00'),
    (2, 'Петров Петр Петрович', '2017-05-14 09:30:00'),
    (3, 'Сидоров Сидр Сидорович', '2017-05-14 13:00:00'),
    (4, 'Козлов Козёл Козлович', '2017-05-14 14:30:00'),
    (5, 'Федорова Федора Федоровна', '2017-05-14 16:00:00'),
    (6, 'Алексеев Алексей Алексеевич', '2017-05-15 13:00:00'),
    (7, 'Дмитриев Дмитрий Дмитриевич', '2017-05-15 14:30:00');

UPDATE `calendar`
SET `visit_date` = DATE_ADD(`visit_date`, INTERVAL 90 MINUTE)
WHERE DATE(`visit_date`) = '2017-05-14' AND HOUR(`visit_date`) >= 13;

SELECT * FROM `calendar`;

-- +----+-----------------------------+---------------------+
-- | id | name                        | visit_date          |
-- +----+-----------------------------+---------------------+
-- | 1  | Иванов Иван Иванович        | 2017-05-14 08:00:00 |
-- | 2  | Петров Петр Петрович         | 2017-05-14 09:30:00 |
-- | 3  | Сидоров Сидр Сидорович       | 2017-05-14 14:30:00 |
-- | 4  | Козлов Козёл Козлович        | 2017-05-14 16:00:00 |
-- | 5  | Федорова Федора Федоровна    | 2017-05-14 17:30:00 |
-- | 6  | Алексеев Алексей Алексеевич  | 2017-05-15 13:00:00 |
-- | 7  | Дмитриев Дмитрий Дмитриевич  | 2017-05-15 14:30:00 |
-- +----+-----------------------------+---------------------+
