DROP TABLE IF EXISTS `reviews`;
CREATE TABLE `reviews` (
    id      INT                             NOT NULL,
    user_id INT                             NOT NULL,
    date    DATETIME                        NOT NULL DEFAULT CURRENT_TIMESTAMP,
    course  ENUM('python', 'sql', 'all')    NOT NULL DEFAULT 'all',
    text    TEXT                            NOT NULL,
    public  TINYINT(1)                      NOT NULL DEFAULT 0,

    PRIMARY KEY (`id`)
);

INSERT INTO `reviews` (id, user_id, date, course, text, public) VALUES
(1, 817,  '2018-01-11 19:50:01', 'sql',    'Лучший курс чтобы начать изучать SQL', 1),
(2, 1289, '2018-02-16 08:55:11', 'python', 'Отличный курс по python - будете знать базу и даже больше.', 1),
(3, 2914, '2018-03-19 12:56:12', 'all',    'Спасибо Никите за классные курсы!', 1);

-- +----+---------+---------------------+--------+-------------------------------------------------------------+--------+
-- | id | user_id | date                | course | text                                                        | public |
-- +----+---------+---------------------+--------+-------------------------------------------------------------+--------+
-- | 1  | 817     | 2018-01-11 19:50:01 | sql    | Лучший курс чтобы начать изучать SQL                        | TRUE   |
-- | 2  | 1289    | 2018-02-16 08:55:11 | python | Отличный курс по python - будете знать базу и даже больше.  | TRUE   |
-- | 3  | 2914    | 2018-03-19 12:56:12 | all    | Спасибо Никите за классные курсы!                           | TRUE   |
-- +----+---------+---------------------+--------+-------------------------------------------------------------+--------+
