-- GROUP BY col    — группирует строки по уникальным значениям col
-- ABS(x)          — возвращает абсолютное значение числа x
-- AVG(x)          — вычисляет среднее значение x внутри группы
-- ROUND(x, d)     — округляет x до d знаков после запятой
-- HAVING условие  — фильтрует группы после агрегации (в отличие от WHERE, который фильтрует строки до неё)

DROP TABLE IF EXISTS `bus_logs`;

CREATE TABLE `bus_logs` (
    id        INT      NOT NULL AUTO_INCREMENT,
    driver_id INT      DEFAULT NULL,
    time      DATETIME DEFAULT NULL,
    diff      INT      DEFAULT NULL,

    PRIMARY KEY (`id`)
);

INSERT INTO `bus_logs` (id, driver_id, time, diff)
VALUES
    (1, 1, '2018-06-14 12:00:44', 0),
    (2, 2, '2018-06-14 12:01:50', 33),
    (3, 3, '2018-06-14 12:04:20', -60),
    (4, 4, '2018-06-14 12:06:28', 5),
    (5, 1, '2018-06-14 12:08:56', -10),
    (6, 2, '2018-06-14 12:10:01', -1),
    (7, 3, '2018-06-14 12:10:01', 27),
    (8, 4, '2018-06-14 12:10:01', 30),
    (9, 1, '2018-06-14 12:10:01', 22),
    (10, 2, '2018-06-14 12:10:01', 64),
    (11, 3, '2018-06-14 12:10:01', -18),
    (12, 4, '2018-06-14 12:10:01', 12),
    (13, 5, '2018-06-14 12:10:01', 30),
    (14, 2, '2018-06-14 12:10:01', -40),
    (15, 3, '2018-06-14 12:10:01', 18),
    (16, 4, '2018-06-14 12:10:01', 10),
    (17, 1, '2018-06-14 12:10:01', 12),
    (18, 2, '2018-06-14 12:10:01', 34),
    (19, 3, '2018-06-14 12:10:01', -42),
    (20, 4, '2018-06-14 12:10:01', 8),
    (21, 1, '2018-06-14 12:10:01', 5),
    (22, 2, '2018-06-14 12:10:01', 27),
    (23, 3, '2018-06-14 12:10:01', 21),
    (24, 4, '2018-06-14 12:10:01', -4),
    (25, 5, '2018-06-14 12:10:01', -30);

SELECT `driver_id`, ROUND(AVG(ABS(`diff`))) AS `avg_diff`
FROM `bus_logs`
GROUP BY `driver_id`
HAVING AVG(ABS(`diff`)) >= 30;

-- +-----------+----------+
-- | driver_id | avg_diff |
-- +-----------+----------+
-- | 2         | 33       |
-- | 3         | 31       |
-- | 5         | 30       |
-- +-----------+----------+
