DROP TABLE IF EXISTS `users`;
CREATE TABLE `users` (
    id         INT          NOT NULL,
    first_name VARCHAR(50)  NOT NULL,
    last_name  VARCHAR(60)  NOT NULL,
    bio        TEXT         DEFAULT NULL,

    PRIMARY KEY (`id`)
);

INSERT INTO `users` (id, first_name, last_name, bio) VALUES
(1, 'Антон', 'Кулик', 'С отличием окончил 39 лицей.'),
(2, 'Сергей', 'Давыдов', NULL),
(3, 'Дмитрий', 'Соколов', 'Профессиональный программист.');

-- +----+------------+-----------+-------------------------------+
-- | id | first_name | last_name | bio                           |
-- +----+------------+-----------+-------------------------------+
-- | 1  | Антон      | Кулик     | С отличием окончил 39 лицей.  |
-- | 2  | Сергей     | Давыдов   |                               |
-- | 3  | Дмитрий    | Соколов   | Профессиональный программист. |
-- +----+------------+-----------+-------------------------------+
