DROP TABLE IF EXISTS `books`;
CREATE TABLE `books` (
    id          INT           NOT NULL,
    name        VARCHAR(100)  NOT NULL,
    description VARCHAR(1000) DEFAULT NULL,
    isbn        VARCHAR(13)   NOT NULL,

    PRIMARY KEY (`id`)
);

INSERT INTO `books` (id, name, description, isbn) VALUES
(1, 'MySQL 5', 'Хорошая книга.', '5941579284'),
(2, 'Изучаем SQL', 'Полезная книга.', '5932860510'),
(3, 'Изучаем Python. 4-е издание', 'Подробная книга о Python.', '9785932861592');

-- +----+-----------------------------+---------------------------+---------------+
-- | id | name                        | description               | isbn          |
-- +----+-----------------------------+---------------------------+---------------+
-- | 1  | MySQL 5                     | Хорошая книга.            | 5941579284    |
-- | 2  | Изучаем SQL                 | Полезная книга.           | 5932860510    |
-- | 3  | Изучаем Python. 4-е издание | Подробная книга о Python. | 9785932861592 |
-- +----+-----------------------------+---------------------------+---------------+
