CREATE TABLE IF NOT EXISTS `users` (
    id            INT                 NOT NULL,
    first_name    VARCHAR(100)        NOT NULL,
    last_name     VARCHAR(100)        NOT NULL,
    birthday      DATE                NOT NULL,
    pers_info     TINYINT(1)          DEFAULT NULL,

    PRIMARY KEY (`id`)
);

INSERT INTO `users` (id, first_name, last_name, birthday, pers_info) VALUES
(1, 'Дмитрий', 'Петров', '2000-03-14', 1),
(2, 'Ольга', 'Антонова', '1999-12-01', 0),
(3, 'Сергей', 'Васильев', '2002-02-20', NULL),
(4, 'Константин', 'Степаниденко', '2004-03-07', 1),
(5, 'Алена', 'Шикова', '1999-08-17', 1),
(6, 'Василина', 'Парамонова', '2000-10-10', 0),
(7, 'Александр', 'Пузаков', '2002-02-22', NULL),
(8, 'Алина', 'Антонова', '2002-01-01', 0);

SELECT id, first_name, last_name, birthday
FROM users
WHERE pers_info IS NULL OR pers_info = 0
ORDER BY birthday;

+----+------------+--------------+------------+-----------+
| id | first_name | last_name    | birthday   | pers_info |
+----+------------+--------------+------------+-----------+
| 1  | Дмитрий    | Петров       | 2000-03-14 | 1         |
| 2  | Ольга      | Антонова     | 1999-12-01 | 0         |
| 3  | Сергей     | Васильев     | 2002-02-20 | NULL      |
| 4  | Констанин  | Степаниденко | 2004-03-07 | 1         |
| 5  | Алена      | Шикова       | 1999-08-17 | 1         |
| 6  | Василина   | Парамонова   | 2000-10-10 | 0         |
| 7  | Александр  | Пузаков      | 2002-02-22 | NULL      |
| 8  | Алина      | Антонова     | 2002-01-01 | 0         |
+----+------------+--------------+------------+-----------+
